# Напишите программу, которая считывает три целых числа и выводит на экран их сумму. Каждое число записано в отдельной строке.

num0 = int(input())
num1 = int(input())
num2 = int(input())

sum = num0+num1+num2

print(sum)

