# Напишите программу, которая считывает целое положительное число  и выводит на экран последовательность чисел разделённых тремя черточками.

num0 = int(input())

print(num0, num0*2, num0*3, num0*4, num0*5, sep='---')