# Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке. 
# Первое число вводит пользователь, остальные числа вычисляются в программе.

num0 = int(input())

print(num0, num0+1, num0+2, sep="\n")
