#  Напишите программу вычисления значения функции по введеным целым значениям 

a = int(input())
b = int(input())

f = 3*((a+b)**3)+275*(b**2)-127*a-41
print(f)